{
    "title": "How to learn Javascript",
    "description": "JavaScript is typically used as a client-side scripting language for front end development. In simple terms, this means that developers use JavaScript to build the part of a website that ordinary visitors can see and interact with, also known as the “front end.” While the programming language can technically be used to create complex programs, its primary application lies in web development. Front end programmers typically use JavaScript in conjunction with two markup languages, HTML and CSS, to create all of the elements that a user can see and interact with directly. Most common actions, such as transactions, submitting customer feedback, and even logging in, are facilitated by HTML code. CSS, on the other hand, centers more on formatting and appearance; it allows developers to describe how the HTML should look to a visitor. Both, however, are static. With only HTML and CSS, a web page is unchanging and relatively simplistic. Chart showing that JavaScript is the most popular coding language that companies look for With JavaScript, a website becomes dynamic. Not only does it automate processes that users would, in an HTML-only site, need to perform manually, but it also empowers a website to react to a visitor’s input. Autocorrect functions, slideshows, interactive graphics: these can all be credited to JavaScript working tirelessly in the background. That said, JavaScript’s appeal isn’t confined to its functionality. It’s also one of the most intuitive programming languages to learn and use; often, it’s one of the first that newbie developers learn when they start to code. “JavaScript is very easy to implement,” writes one tech journalist for Web Platform. “All you need to do is put your code in the HTML document and tell the browser that it is JavaScript […] then, JavaScript allows you to create highly responsive interfaces that improve the user experience and provide dynamic functionality, without having to wait for the server to react and show another page.” It’s fast, versatile, and can even help identify and fix problems via its browser support functions.",
    "slug": "How-to-learn-javascript",
    "author": "Akash koiri"
}